jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_ports.h
/*
 * "Copyright (c) 2008 Robert B. Reese, Bryan A. Jones, J. W. Bruce ("AUTHORS")"
 * All rights reserved.
 * (R. Reese, reese_AT_ece.msstate.edu, Mississippi State University)
 * (B. A. Jones, bjones_AT_ece.msstate.edu, Mississippi State University)
 * (J. W. Bruce, jwbruce_AT_ece.msstate.edu, Mississippi State University)
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement is
 * hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the authors appear in all copies of this software.
 *
 * IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
 * HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
 *
 * Please maintain this header in its entirety when copying/modifying
 * these files.
 *
 *
 */


#ifndef _PIC24_PORTS_H_
#define _PIC24_PORTS_H_
// Documentation for this file. If the \file tag isn't present,
// this file won't be documented.
/** \file
 *  This file supports configuration of IO ports on the PIC24. Support includes:
 *  - Configuring a pin for analog or digital operation by changing the
 *    corresponding _PCFGn bit. For digital
 *    operation:
 *    - Configure a pin as an input or an output by changing the
 *      corresponding _TRISxy bit.
 *    - Choose an open-drain or standard output driver by changing
 *      the corresponding _CNmPU bit.
 *    - Enable or disable pull-ups by changing the corresponding
 *      _ODCxy bit.
 *    - Enable or disable the interrupt on change mechanism by
 *      changing the corresponding _CNmIE bit.
 *  - A convenient mechanism for mapping a remappable peripheral to 
 *    input or output pins.
 * 
 *  \section portSummary Summary of port configuration macros
 *  The port configuration macros are available in two forms.
 *  <a href="#highLevelPortConfig">Higher-level</a> routines 
 *  completely configure a pin for a specific
 *  operation, while <a href="#lowLevelPortConfig">low-level</a> routines 
 *  provide a more readable name
 *  for changing the value of a single bit (_PCFGn, _TRISxy, _CNmPU, or
 *  _ODCxy).
 *
 *  To reduce the confusing variety of naming schemes for these bits,
 *  the macros refer to a pin either by its port letter \a x plus pin
 *  number \a y (for example, _TRISB3 for the TRIS bit of port B, pin 3)
 *  or by the analog input number \a n (for example, AN0 refers to 
 *  analog input 0).
 *
 *  The macros provided as "smart" - only functions applicable to that
 *  pin are contained in a given macro. For example, 
 *  CONFIG_RA1_AS_DIG_OUTPUT on the PIC24HJ32GP202 disables the pin's
 *  pullup, disables the open-drain driver, disables analog functionality,
 *  then sets the pin as an output. CONFIG_RA7_AS_DIG_OUTPUT on the
 *  PIC24HJ32GP204 only disables the open-drain driver and sets the pin
 *  as an output, because that pin supports neither analog nor pullup
 *  functionality.
 *
 *  \todo Put stub documentation for ALL port macros (doxygen only) so
 *  they hyperlink in source code
 *
 *  \todo Add a macro in for TRIS bit configuration
 *
 *  \todo Brief documentation for all remappable peripherals
 */

// Dummy macros for documentation only
#ifdef __DOXYGEN__
/** \name High-level port configuration
 *  <a name="highLevelPortConfig">These</a> macros choose 
 *  digital or analog, input or
 *  output, open-drain or standard. Use the low-level
 *  \ref ENABLE_Rxy_PULLUP() "ENABLE"/\ref DISABLE_Rxy_PULLUP() to 
 *  configure the pullup.
 */
//@{
/** This macro disables open-drain and pullups,
 *  configures port x pin y for digital (not analog) operation, and
 *  sets the pin as an output. For example, CONFIG_RA10_AS_DIG_OUTPUT()
 *  makes port A, pin 10 a digital output.
 */
static inline void CONFIG_Rxy_AS_DIG_OUTPUT() {}

/** This macro enables open-drain, disables pullups,
 *  configures port x pin y for digital (not analog) operation, and
 *  sets the pin as an output. For example, CONFIG_RA10_AS_DIG_OD_OUTPUT()
 *  makes port A, pin 10 a digital output.
 */
static inline void CONFIG_Rxy_AS_DIG_OD_OUTPUT() {}

/** This macro disables pullups and analog functionality and sets
 *  the pin as an input. For example, CONFIG_RA10_AS_DIG_OUTPUT() makes
 *  port A, pin 10 a digital input.
 */
static inline void CONFIG_Rxy_AS_DIG_INPUT() {}

/** This macro first calls \ref CONFIG_Rxy_AS_DIG_INPUT() to disable
 *  pullups on the pin then enables analog functionality on the pin.
 *  For example, CONFIG_AN1_AS_ANALOG() makes AN1 an analog input pin.
 */
static inline void CONFIG_ANx_AS_ANALOG() {}
//@}

/** \name Low-level port configuration macros
 *  <a name="lowLevelPortConfig">These</a> macros support low-level pin 
 *  configuration in the following areas:
 *  - Digital vs. analog configuration: 
 *    - ENABLE_Rxy_ANALOG() sets the corresponding _PCFGn bit,
 *      while DISABLE_Rxy_ANALOG() clears the corresponding _PCFGn bit.
 *    - CONFIG_RPy_AS_DIG_PIN() sets the corresponding _PCFGn bit.
 *  - Input vs. output configuration: none. Instead, simply assign to
 *    the _TRISxy flag directly: _TRISB1 = 1 makes port B, pin 1 an input
 *    while _TRISB1 = 0 makes it an output.
 *  - Open-drain vs. standard output driver: ENABLE_Rxy_OPENDRAIN(),
 *    DISABLE_Rxy_OPENDRAIN()
 *  - Pull-up configuration: ENABLE_Rxy_PULLUP(), DISABLE_Rxy_PULLUP()
 *  - Change notification configuration: ENABLE_Rxy_CN_INTERRUPT(),
 *    DISABLE_Rxy_CN_INTERRUPT()
 */
//@{

/** Enables analog functionality on port x of pin y by clearing the
 *  corresponding _PCFGn bit. For example, ENABLE_RA10_ANALOG() enables
 *  analog functionality on port A pin 10.
 */
#define ENABLE_Rxy_ANALOG() _PCFGn = 0

/** Disables analog functionality on port x of pin y by setting the
 *  corresponding _PCFGn bit. For example, DISABLE_RA10_ANALOG() disables
 *  analog functionality on port A pin 10.
 */
#define DISABLE_Rxy_ANALOG() _PCFGn = 1

/** Makes port P, pin y a digital pin by disabling analog functionality
 *  on that pin. This is done by setting the
 *  corresponding _PCFGn bit. For example, CONFIG_RP10_AS_DIG_PIN() makes
 *  port P, pin 10 a digital pin by disabling analog its functionality.
 */
#define CONFIG_RPy_AS_DIG_PIN() _PCFG = 1

/** Enables the open-drain driver on port x, pin y. For example, 
 *  ENABLE_Rxy_OPENDRAIN()
 */
#define ENABLE_Rxy_OPENDRAIN() _ODCxy = 1

/** Disables the open-drain driver on port x, pin y. For example, 
 *  DISABLE_Rxy_OPENDRAIN()
 */
#define DISABLE_Rxy_OPENDRAIN() _ODCxy = 0

